In [1]:
pip install pyodbc

Requirement already satisfied: pyodbc in c:\users\samsung\appdata\local\programs\python\python313\lib\site-packages (5.3.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pyodbc
import pandas as pd
import matplotlib.pyplot as plt

connection_data = (
    "Driver={SQL Server};"
    "Server=LAPTOP-SRP0M4NC;"
    "Database=ContosoRetailDW;"
)

connection = pyodbc.connect(connection_data)
print("Connection successful!")

Matplotlib is building the font cache; this may take a moment.

Connection successful!

In [4]:
sql_command = "SELECT ColorName, UnitPrice FROM DimProduct"

data_df = pd.read_sql(sql_command, connection)

C:\Users\samsung\AppData\Local\Temp\ipykernel_20628\1821974956.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data_df = pd.read_sql(sql_command, connection)

In [5]:
display(data_df)

     ColorName  UnitPrice
0       Silver      12.99
1         Blue      12.99
2        White      14.52
3       Silver      21.57
4          Red      21.57
...        ...        ...
2512       Red     129.99
2513     White     129.99
2514     White       3.35
2515     Black       3.35
2516    Silver       3.35

[2517 rows x 2 columns]

In [6]:
total_products_by_color = data_df.groupby('ColorName').count()

In [7]:
display(total_products_by_color)

             UnitPrice
ColorName
Azure               14
Black              602
Blue               197
Brown               77
Gold                50
Green               74
Grey               283
Orange              55
Pink                84
Purple               6
Red                 99
Silver             417
Silver Grey         14
Transparent          1
White              505
Yellow              36
blue                 3